STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_ca35.h
/*
 * @brief  (CSI)
 */
typedef struct
{
  __IO uint32_t CR;               /*!< CSI-2 Host control register                           Address offset: 0x0000 */
  __IO uint32_t PCR;              /*!< CSI-2 Host DPHY_RX control register                   Address offset: 0x0004 */
       uint32_t RESERVED0[2];     /*!< Reserved                                              Address offset: 0x0008-0x000C */
  __IO uint32_t VC0CFGR1;         /*!< CSI-2 Host virtual channel 0 configuration register 1 Address offset: 0x0010 */
  __IO uint32_t VC0CFGR2;         /*!< CSI-2 Host virtual channel 0 configuration register 2 Address offset: 0x0014 */
  __IO uint32_t VC0CFGR3;         /*!< CSI-2 Host virtual channel 0 configuration register 3 Address offset: 0x0018 */
  __IO uint32_t VC0CFGR4;         /*!< CSI-2 Host virtual channel 0 configuration register 4 Address offset: 0x001C */
  __IO uint32_t VC1CFGR1;         /*!< CSI-2 Host virtual channel 1 configuration register 1 Address offset: 0x0020 */
  __IO uint32_t VC1CFGR2;         /*!< CSI-2 Host virtual channel 1 configuration register 2 Address offset: 0x0024 */
  __IO uint32_t VC1CFGR3;         /*!< CSI-2 Host virtual channel 1 configuration register 3 Address offset: 0x0028 */
  __IO uint32_t VC1CFGR4;         /*!< CSI-2 Host virtual channel 1 configuration register 4 Address offset: 0x002C */
  __IO uint32_t VC2CFGR1;         /*!< CSI-2 Host virtual channel 2 configuration register 1 Address offset: 0x0030 */
  __IO uint32_t VC2CFGR2;         /*!< CSI-2 Host virtual channel 2 configuration register 2 Address offset: 0x0034 */
  __IO uint32_t VC2CFGR3;         /*!< CSI-2 Host virtual channel 2 configuration register 3 Address offset: 0x0038 */
  __IO uint32_t VC2CFGR4;         /*!< CSI-2 Host virtual channel 2 configuration register 4 Address offset: 0x003C */
  __IO uint32_t VC3CFGR1;         /*!< CSI-2 Host virtual channel 3 configuration register 1 Address offset: 0x0040 */
  __IO uint32_t VC3CFGR2;         /*!< CSI-2 Host virtual channel 3 configuration register 2 Address offset: 0x0044 */
  __IO uint32_t VC3CFGR3;         /*!< CSI-2 Host virtual channel 3 configuration register 3 Address offset: 0x0048 */
  __IO uint32_t VC3CFGR4;         /*!< CSI-2 Host virtual channel 3 configuration register 4 Address offset: 0x004C */
  __IO uint32_t LB0CFGR;          /*!< CSI-2 Host line byte 0 configuration register         Address offset: 0x0050 */
  __IO uint32_t LB1CFGR;          /*!< CSI-2 Host line byte 1 configuration register         Address offset: 0x0054 */
  __IO uint32_t LB2CFGR;          /*!< CSI-2 Host line byte 2 configuration register         Address offset: 0x0058 */
  __IO uint32_t LB3CFGR;          /*!< CSI-2 Host line byte 3 configuration register         Address offset: 0x005C */
  __IO uint32_t TIM0CFGR;         /*!< CSI-2 Host timer 0 configuration register             Address offset: 0x0060 */
  __IO uint32_t TIM1CFGR;         /*!< CSI-2 Host timer 1 configuration register             Address offset: 0x0064 */
  __IO uint32_t TIM2CFGR;         /*!< CSI-2 Host timer 2 configuration register             Address offset: 0x0068 */
  __IO uint32_t TIM3CFGR;         /*!< CSI-2 Host timer 3 configuration register             Address offset: 0x006C */
  __IO uint32_t LMCFGR;           /*!< CSI-2 Host lane merger configuration register         Address offset: 0x0070 */
  __IO uint32_t PRGITR;           /*!< CSI-2 Host program interrupt register                 Address offset: 0x0074 */
  __IO uint32_t WDR;              /*!< CSI-2 Host watchdog register                          Address offset: 0x0078 */
       uint32_t RESERVED1;        /*!< Reserved                                              Address offset: 0x007C */
  __IO uint32_t IER0;             /*!< CSI-2 Host Interrupt enable register 0                Address offset: 0x0080 */
  __IO uint32_t IER1;             /*!< CSI-2 Host Interrupt enable register 1                Address offset: 0x0084 */
       uint32_t RESERVED2[2];     /*!< Reserved                                              Address offset: 0x0088-0x008C */
  __IO uint32_t SR0;              /*!< CSI-2 Host status register 0                          Address offset: 0x0090 */
  __IO uint32_t SR1;              /*!< CSI-2 Host status register 1                          Address offset: 0x0094 */
       uint32_t RESERVED3[26];    /*!< Reserved                                              Address offset: 0x0098-0x00FC */
  __IO uint32_t FCR0;             /*!< CSI-2 Host Flag clear register 0                      Address offset: 0x0100 */
  __IO uint32_t FCR1;             /*!< CSI-2 Host Flag clear register 1                      Address offset: 0x0104 */
       uint32_t RESERVED4[2];     /*!< Reserved                                              Address offset: 0x0108-0x010C */
  __IO uint32_t SPDFR;            /*!< CSI-2 Host short packet data field register           Address offset: 0x0110 */
  __IO uint32_t ERR1;             /*!< CSI-2 Host error register 1                           Address offset: 0x0114 */
  __IO uint32_t ERR2;             /*!< CSI-2 Host error register 2                           Address offset: 0x0118 */
       uint32_t RESERVED5[949];   /*!< Reserved                                              Address offset: 0x011C-0x0FEC */
  __IO uint32_t HHWCFGR;          /*!< CSI-2 Host hardware configuration register            Address offset: 0x0FF0 */
  __IO uint32_t HVERR;            /*!< CSI-2 Host version register                           Address offset: 0x0FF4 */
  __IO uint32_t HIPIDR;           /*!< CSI-2 Host identification register                    Address offset: 0x0FF8 */
  __IO uint32_t HSIDR;            /*!< CSI-2 Host size identification register               Address offset: 0x0FFC */
  __IO uint32_t PRCR;             /*!< CSI PHY reset control register                        Address offset: 0x1000 */
  __IO uint32_t PMCR;             /*!< CSI PHY mode control register                         Address offset: 0x1004 */
  __IO uint32_t PFCR;             /*!< CSI PHY frequency control register                    Address offset: 0x1008 */
       uint32_t RESERVED6;        /*!< Reserved                                              Address offset: 0x100C */
  __IO uint32_t PTCR0;            /*!< CSI PHY test control register 0                       Address offset: 0x1010 */
  __IO uint32_t PTCR1;            /*!< CSI PHY test control register 1                       Address offset: 0x1014 */
  __IO uint32_t PTSR;             /*!< CSI PHY test status register                          Address offset: 0x1018 */
       uint32_t RESERVED7[1013];  /*!< Reserved                                              Address offset: 0x101C-0x1FEC */
  __IO uint32_t HWCFGR;           /*!< CSI-2 Host hardware configuration register            Address offset: 0x1FF0 */
  __IO uint32_t VERR;             /*!< CSI-2 Host version register                           Address offset: 0x1FF4 */
  __IO uint32_t IPIDR;            /*!< CSI-2 Host identification register                    Address offset: 0x1FF8 */
  __IO uint32_t SIDR;             /*!< CSI-2 Host size identification register               Address offset: 0x1FFC */
} CSI_TypeDef;

/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;        /*!< MCU device ID code                                          Address offset: 0x00 */
  __IO uint32_t CR;            /*!< DBGMCU Configuration Register                               Address offset: 0x04 */
  __IO uint32_t CRA35;         /*!< DBGMCU Configuration Register CPU1                          Address offset: 0x08 */
  __IO uint32_t RESERVED1;     /*!< Reserved                                                    Address offset: 0x0C */
  __IO uint32_t AHB2LFZ1;      /*!< DBGMCU AHB2 (lowest part) Peripheral Freeze Register CPU1   Address offset: 0x10 */
  __IO uint32_t AHB2HFZ1;      /*!< DBGMCU AHB2 (highest part) Peripheral Freeze Register CPU1  Address offset: 0x14 */
  __IO uint32_t AHB2LFZ2;      /*!< DBGMCU AHB2 (lowest part) Peripheral Freeze Register CPU2   Address offset: 0x18 */
  __IO uint32_t AHB2HFZ2;      /*!< DBGMCU AHB2 (highest part) Peripheral Freeze Register CPU2  Address offset: 0x1C */
  __IO uint32_t AHBSRFZ1;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU1                Address offset: 0x20 */
  __IO uint32_t AHBSRFZ2;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU2                Address offset: 0x24 */
  __IO uint32_t AHBSRFZ3;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU3                Address offset: 0x28 */
  __IO uint32_t APB1FZ1;       /*!< DBGMCU APB1 Peripheral Freeze Register CPU1                 Address offset: 0x2C */
  __IO uint32_t APB1FZ2;       /*!< DBGMCU APB1 Peripheral Freeze Register CPU2                 Address offset: 0x30 */
  __IO uint32_t APB2FZ1;       /*!< DBGMCU APB2 Peripheral Freeze Register CPU1                 Address offset: 0x34 */
  __IO uint32_t APB2FZ2;       /*!< DBGMCU APB2 Peripheral Freeze Register CPU2                 Address offset: 0x38 */
  __IO uint32_t APB3FZ1;       /*!< DBGMCU APB3 Peripheral Freeze Register CPU1                 Address offset: 0x3C */
  __IO uint32_t APB3FZ2;       /*!< DBGMCU APB3 Peripheral Freeze Register CPU2                 Address offset: 0x40 */
  __IO uint32_t APBSRFZ1;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU1                Address offset: 0x44 */
  __IO uint32_t APBSRFZ2;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU2                Address offset: 0x48 */
  __IO uint32_t APBSRFZ3;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU3                Address offset: 0x4C */
} DBGMCU_TypeDef;

/**
  * @brief DCMI
  */

typedef struct
{
  __IO uint32_t CR;       /*!< DCMI control register 1,                       Address offset: 0x000 */
  __IO uint32_t SR;       /*!< DCMI status register,                          Address offset: 0x004 */
  __IO uint32_t RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x008 */
  __IO uint32_t IER;      /*!< DCMI interrupt enable register,                Address offset: 0x00C */
  __IO uint32_t MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x010 */
  __IO uint32_t ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x014 */
  __IO uint32_t ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x018 */
  __IO uint32_t ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x01C */
  __IO uint32_t CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x020 */
  __IO uint32_t CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x024 */
  __IO uint32_t DR;       /*!< DCMI data register,                            Address offset: 0x028 */
  uint32_t RESERVED[242]; /*!< Reserved,                                              0x02C - 0x3F0 */
  __IO uint32_t VERR;     /*!< DCMI Version register,                         Address offset: 0x3F4 */
  __IO uint32_t IPDR;     /*!< DCMI Identification register,                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;     /*!< DCMI Size Identification register,             Address offset: 0x3FC */
} DCMI_TypeDef;

