STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_ca35.h
/*******************  Bits definition for PKA_VERR register  **************/
#define PKA_VERR_MINREV_Pos    (0U)
#define PKA_VERR_MINREV_Msk    (0x4UL << PKA_VERR_MINREV_Pos)      /*!< 0x00000004 */
#define PKA_VERR_MINREV        PKA_CLRFR_MINREV_Msk                /*!< PKA Minor version */
#define PKA_VERR_MAJREV_Pos    (4U)
#define PKA_VERR_MAJREV_Msk    (0x4UL << PKA_VERR_MAJREV_Pos)      /*!< 0x00000040 */
#define PKA_VERR_MAJREV        PKA_CLRFR_MAJREV_Msk                /*!< PKA Major version */

/*******************  Bits definition for PKA_IPIDR register  **************/
#define PKA_IPIDR_ID_Pos    (0U)
#define PKA_IPIDR_ID_Msk    (0xFFFFFFFFUL << PKA_IPIDR_ID_Pos)     /*!< 0xFFFFFFFF */
#define PKA_IPIDR_ID        PKA_CLRFR_ID_Msk                       /*!< PKA ID */

/*******************  Bit definition for PKA_SIDR register  *******************/
#define PKA_SIDR_SID_Pos          (0U)
#define PKA_SIDR_SID_Msk          (0xFFFFFFFFUL << PKA_SIDR_SID_Pos)  /*!< 0xFFFFFFFF */
#define PKA_SIDR_SID              PKA_SIDR_SID_Msk                   /*!< Size identification code */

/*******************  Bits definition for PKA RAM  *************************/
#define PKA_RAM_OFFSET                            0x400U                           /*!< PKA RAM address offset */

/* Compute Montgomery parameter input data */
#define PKA_MONTGOMERY_PARAM_IN_MOD_NB_BITS       ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_MONTGOMERY_PARAM_IN_MODULUS           ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus */

/* Compute Montgomery parameter output data */
#define PKA_MONTGOMERY_PARAM_OUT_PARAMETER        ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Output Montgomery parameter */

/* Compute modular exponentiation input data */
#define PKA_MODULAR_EXP_IN_EXP_NB_BITS            ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent number of bits */
#define PKA_MODULAR_EXP_IN_OP_NB_BITS             ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_MODULAR_EXP_IN_MONTGOMERY_PARAM       ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Input storage area for Montgomery parameter */
#define PKA_MODULAR_EXP_IN_EXPONENT_BASE          ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input base of the exponentiation */
#define PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE  ((0x16C8U - PKA_RAM_OFFSET)>>2)  /*!< Input base of the exponentiation(protected) */
#define PKA_MODULAR_EXP_IN_EXPONENT               ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent to process */
#define PKA_MODULAR_EXP_PROTECT_IN_EXPONENT       ((0x14B8U - PKA_RAM_OFFSET)>>2)  /*!< Input exponent to process (protected) */
#define PKA_MODULAR_EXP_IN_MODULUS                ((0x1088U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus */
#define PKA_MODULAR_EXP_PROTECT_IN_MODULUS        ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus (protected) */
#define PKA_MODULAR_EXP_PROTECT_IN_PHI            ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input Phi (protected) */

/* Compute modular exponentiation output data */
#define PKA_MODULAR_EXP_OUT_MONTGOMERY_PARAM      ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Output storage area for Montgomery parameter */
#define PKA_MODULAR_EXP_OUT_SM_ALGO_ACC1          ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Output SM algorithm accumulator 1 */
#define PKA_MODULAR_EXP_OUT_RESULT                ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Output for modular exponentiation */
#define PKA_MODULAR_EXP_OUT_ERROR                 ((0x1298U - PKA_RAM_OFFSET)>>2)  /*!< Output error code*/

/* Compute ECC scalar multiplication input data */
#define PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS         ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent number of bits */
#define PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS          ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN        ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_A_COEFF             ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_B_COEFF             ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_MOD_GF              ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus GF(p) */
#define PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER       ((0xF88U - PKA_RAM_OFFSET)>>2)   /*!< Input curve prime order n */

#define PKA_ECC_SCALAR_MUL_IN_K                   ((0x12A0U - PKA_RAM_OFFSET)>>2)  /*!< Input 'k' of KP */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X     ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y     ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */

/* Compute ECC scalar multiplication output data */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_X           ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_Y           ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_ERROR              ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* Compute ECC complete addition input data */
#define PKA_ECC_COMPLETE_ADD_IN_MOD_NB_BITS         ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus number of bits */
#define PKA_ECC_COMPLETE_ADD_IN_A_COEFF_SIGN        ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_COMPLETE_ADD_IN_MOD_P               ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus value p */
#define PKA_ECC_COMPLETE_ADD_IN_A_COEFF             ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Curve coef a */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_X            ((0x628U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_Y            ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_Z            ((0x6D8U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Z coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_X            ((0x730U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P X coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_Y            ((0x788U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P Y coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_Z            ((0x7E0U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P Z coordinate */

/* Compute ECC complete addition output data */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_X           ((0xD60U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_Y           ((0xDB8U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_Z           ((0xE10U - PKA_RAM_OFFSET)>>2)   /*!< Output result Z coordinate */

/* Compute ECC double base ladder input data */
#define PKA_ECC_DOUBLE_LADDER_IN_PRIME_ORDER_NB_BITS ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input curve prime order 'n' number of bits */
#define PKA_ECC_DOUBLE_LADDER_IN_MOD_NB_BITS         ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus 'p' number of bits */
#define PKA_ECC_DOUBLE_LADDER_IN_A_COEFF_SIGN        ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_DOUBLE_LADDER_IN_A_COEFF             ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Curve coef a */
#define PKA_ECC_DOUBLE_LADDER_IN_MOD_P               ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus value p */
#define PKA_ECC_DOUBLE_LADDER_IN_K_INTEGER           ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input integer 'k' */
#define PKA_ECC_DOUBLE_LADDER_IN_M_INTEGER           ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input integer 'M' */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_X            ((0x628U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_Y            ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_Z            ((0x6D8U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Z coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_X            ((0x730U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P X coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_Y            ((0x788U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P Y coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_Z            ((0x7E0U - PKA_RAM_OFFSET)>>2)   /*!< Input second point P Z coordinate */

/* Compute ECC double base ladder output data */
#define PKA_ECC_DOUBLE_LADDER_OUT_RESULT_X           ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_DOUBLE_LADDER_OUT_RESULT_Y           ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_DOUBLE_LADDER_OUT_ERROR              ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* Compute ECC projective to affine input data */
#define PKA_ECC_PROJECTIVE_AFF_IN_MOD_NB_BITS         ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus 'p' number of bits */
#define PKA_ECC_PROJECTIVE_AFF_IN_MOD_P               ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input curve modulus value p */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_X             ((0xD60U - PKA_RAM_OFFSET)>>2)   /*!< Input  point P X coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_Y             ((0xDB8U - PKA_RAM_OFFSET)>>2)   /*!< Input  point P Y coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_Z             ((0xE10U - PKA_RAM_OFFSET)>>2)   /*!< Input  point P Z coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_MONTGOMERY_PARAM_R2 ((0x4C8U - PKA_RAM_OFFSET)>>2)   /*!< Input  montgomery parameter R2 mod n */

/* Compute ECC projective to affine output data */
#define PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_X           ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_Y           ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_PROJECTIVE_AFF_OUT_ERROR              ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* Point check input data */
#define PKA_POINT_CHECK_IN_MOD_NB_BITS            ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_POINT_CHECK_IN_A_COEFF_SIGN           ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_POINT_CHECK_IN_A_COEFF                ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_POINT_CHECK_IN_B_COEFF                ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient */
#define PKA_POINT_CHECK_IN_MOD_GF                 ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus GF(p) */
#define PKA_POINT_CHECK_IN_INITIAL_POINT_X        ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_POINT_CHECK_IN_INITIAL_POINT_Y        ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_POINT_CHECK_IN_MONTGOMERY_PARAM       ((0x4C8U - PKA_RAM_OFFSET)>>2)   /*!< Input Montgomery parameter R2 mod n */

/* Point check output data */
#define PKA_POINT_CHECK_OUT_ERROR                 ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* ECDSA signature input data */
#define PKA_ECDSA_SIGN_IN_ORDER_NB_BITS           ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input order number of bits */
#define PKA_ECDSA_SIGN_IN_MOD_NB_BITS             ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECDSA_SIGN_IN_A_COEFF_SIGN            ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECDSA_SIGN_IN_A_COEFF                 ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECDSA_SIGN_IN_B_COEFF                 ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient (positive) */
#define PKA_ECDSA_SIGN_IN_MOD_GF                  ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus GF(p) */
#define PKA_ECDSA_SIGN_IN_K                       ((0x12A0U - PKA_RAM_OFFSET)>>2)  /*!< Input k value of the ECDSA */
#define PKA_ECDSA_SIGN_IN_INITIAL_POINT_X         ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y         ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECDSA_SIGN_IN_HASH_E                  ((0xFE8U - PKA_RAM_OFFSET)>>2)   /*!< Input e, hash of the message */
#define PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D           ((0xF28U - PKA_RAM_OFFSET)>>2)   /*!< Input d, private key */
#define PKA_ECDSA_SIGN_IN_ORDER_N                 ((0xF88U - PKA_RAM_OFFSET)>>2)   /*!< Input n, order of the curve */

/* ECDSA signature output data */
#define PKA_ECDSA_SIGN_OUT_ERROR                  ((0xFE0U - PKA_RAM_OFFSET)>>2)   /*!< Output error code*/
#define PKA_ECDSA_SIGN_OUT_SIGNATURE_R            ((0x730U - PKA_RAM_OFFSET)>>2)   /*!< Output signature r */
#define PKA_ECDSA_SIGN_OUT_SIGNATURE_S            ((0x788U - PKA_RAM_OFFSET)>>2)   /*!< Output signature s */
#define PKA_ECDSA_SIGN_OUT_FINAL_POINT_X          ((0x1400U - PKA_RAM_OFFSET)>>2)  /*!< Output kG x coordinate */
#define PKA_ECDSA_SIGN_OUT_FINAL_POINT_Y          ((0x1458U - PKA_RAM_OFFSET)>>2)  /*!< Output kG y coordinate */

/* ECDSA verification input data */
#define PKA_ECDSA_VERIF_IN_ORDER_NB_BITS          ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input order number of bits */
#define PKA_ECDSA_VERIF_IN_MOD_NB_BITS            ((0x4C8U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECDSA_VERIF_IN_A_COEFF_SIGN           ((0x468U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECDSA_VERIF_IN_A_COEFF                ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECDSA_VERIF_IN_MOD_GF                 ((0x4D0U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus GF(p) */
#define PKA_ECDSA_VERIF_IN_INITIAL_POINT_X        ((0x678U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y        ((0x6D0U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X     ((0x12F8U - PKA_RAM_OFFSET)>>2)  /*!< Input public key point X coordinate */
#define PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y     ((0x1350U - PKA_RAM_OFFSET)>>2)  /*!< Input public key point Y coordinate */
#define PKA_ECDSA_VERIF_IN_SIGNATURE_R            ((0x10E0U - PKA_RAM_OFFSET)>>2)  /*!< Input r, part of the signature */
#define PKA_ECDSA_VERIF_IN_SIGNATURE_S            ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input s, part of the signature */
#define PKA_ECDSA_VERIF_IN_HASH_E                 ((0x13A8U - PKA_RAM_OFFSET)>>2)  /*!< Input e, hash of the message */
#define PKA_ECDSA_VERIF_IN_ORDER_N                ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input n, order of the curve */

