STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_ca35.h
#define RISC_PERCIDCFGR_SEMEN_Pos     (1U)
#define RISC_PERCIDCFGR_SEMEN_Msk     (0x1UL << RISC_PERCIDCFGR_SEMEN_Pos)       /*!< 0x00000002 */
#define RISC_PERCIDCFGR_SEMEN         RISC_PERCIDCFGR_SEMEN_Msk

#define RISC_PERCIDCFGR_SCID_Pos      (4U)
#define RISC_PERCIDCFGR_SCID_Msk      (0x7UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000070 */
#define RISC_PERCIDCFGR_SCID          RISC_PERCIDCFGR_SCID_Msk
#define RISC_PERCIDCFGR_SCID0         (0x0UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000000 */
#define RISC_PERCIDCFGR_SCID1         (0x1UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000010 */
#define RISC_PERCIDCFGR_SCID2         (0x2UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000020 */
#define RISC_PERCIDCFGR_SCID3         (0x3UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000030 */
#define RISC_PERCIDCFGR_SCID4         (0x4UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000040 */
#define RISC_PERCIDCFGR_SCID5         (0x5UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000050 */
#define RISC_PERCIDCFGR_SCID6         (0x6UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000060 */
#define RISC_PERCIDCFGR_SCID7         (0x7UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000070 */

#define RISC_PERCIDCFGR_SEMWL_Pos     (16U)
#define RISC_PERCIDCFGR_SEMWL_Msk     (0xFFUL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00FF0000 */
#define RISC_PERCIDCFGR_SEMWL         RISC_PERCIDCFGR_SEMWL_Msk
#define RISC_PERCIDCFGR_SEMWLC0       (0x1UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00010000 */
#define RISC_PERCIDCFGR_SEMWLC1       (0x2UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00020000 */
#define RISC_PERCIDCFGR_SEMWLC2       (0x4UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00040000 */
#define RISC_PERCIDCFGR_SEMWLC3       (0x8UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00080000 */
#define RISC_PERCIDCFGR_SEMWLC4       (0x10UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00100000 */
#define RISC_PERCIDCFGR_SEMWLC5       (0x20UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00200000 */
#define RISC_PERCIDCFGR_SEMWLC6       (0x40UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00400000 */
#define RISC_PERCIDCFGR_SEMWLC7       (0x80UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00800000 */

/*******************  Bits definition for RISC_PERx_SEMCR register ************/
#define RISC_PERSEMCR_SEMMUTEX_Pos    (0U)
#define RISC_PERSEMCR_SEMMUTEX_Msk    (0x1UL << RISC_PERSEMCR_SEMMUTEX_Pos)      /*!< 0x00000001 */
#define RISC_PERSEMCR_SEMMUTEX        RISC_PERSEMCR_SEMMUTEX_Msk

#define RISC_PERSEMCR_SEMCID_Pos      (4U)
#define RISC_PERSEMCR_SEMCID_Msk      (0x7UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000070 */
#define RISC_PERSEMCR_SEMCID          RISC_PERSEMCR_SEMCID_Msk
#define RISC_PERSEMCR_SEMCID0         (0x0UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000000 */
#define RISC_PERSEMCR_SEMCID1         (0x1UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000010 */
#define RISC_PERSEMCR_SEMCID2         (0x2UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000020 */
#define RISC_PERSEMCR_SEMCID3         (0x3UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000030 */
#define RISC_PERSEMCR_SEMCID4         (0x4UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000040 */
#define RISC_PERSEMCR_SEMCID5         (0x5UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000050 */
#define RISC_PERSEMCR_SEMCID6         (0x6UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000060 */
#define RISC_PERSEMCR_SEMCID7         (0x7UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000070 */

/*******************  Bits definition for RISC_REGx_zCFGR register ************/
#define RISC_REGCFGR_SREN_Pos         (0U)
#define RISC_REGCFGR_SREN_Msk         (0x1UL << RISC_REGCFGR_SREN_Pos)           /*!< 0x00000001 */
#define RISC_REGCFGR_SREN             RISC_REGCFGR_SREN_Msk

#define RISC_REGCFGR_RLOCK_Pos        (1U)
#define RISC_REGCFGR_RLOCK_Msk        (0x1UL << RISC_REGCFGR_RLOCK_Pos)          /*!< 0x00000002 */
#define RISC_REGCFGR_RLOCK            RISC_REGCFGR_RLOCK_Msk

#define RISC_REGCFGR_SRCID_Pos        (4U)
#define RISC_REGCFGR_SRCID_Msk        (0x7UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000070 */
#define RISC_REGCFGR_SRCID            RISC_REGCFGR_SRCID_Msk
#define RISC_REGCFGR_SRCID0           (0x0UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000000 */
#define RISC_REGCFGR_SRCID1           (0x1UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000010 */
#define RISC_REGCFGR_SRCID2           (0x2UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000020 */
#define RISC_REGCFGR_SRCID3           (0x3UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000030 */
#define RISC_REGCFGR_SRCID4           (0x4UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000040 */
#define RISC_REGCFGR_SRCID5           (0x5UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000050 */
#define RISC_REGCFGR_SRCID6           (0x6UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000060 */
#define RISC_REGCFGR_SRCID7           (0x7UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000070 */

#define RISC_REGCFGR_SEC_Pos          (8U)
#define RISC_REGCFGR_SEC_Msk          (0x1UL << RISC_REGCFGR_SEC_Pos)            /*!< 0x00000100 */
#define RISC_REGCFGR_SEC              RISC_REGCFGR_SEC_Msk

#define RISC_REGCFGR_PRIV_Pos         (9U)
#define RISC_REGCFGR_PRIV_Msk         (0x1UL << RISC_REGCFGR_PRIV_Pos)           /*!< 0x00000200 */
#define RISC_REGCFGR_PRIV             RISC_REGCFGR_PRIV_Msk

/*******************  Bits definition for RISC_REGx_zADDR register ************/
#define RISC_REG3ADDR_SUBSTART_Pos    (0U)
#define RISC_REG3ADDR_SUBSTART_Msk    (0x7FFUL << RISC_REG3ADDR_SUBSTART_Pos)    /*!< 0x000007FF */
#define RISC_REG3ADDR_SUBSTART        RISC_REG3ADDR_SUBSTART_Msk

#define RISC_REG3ADDR_SUBLENGTH_Pos   (16U)
#define RISC_REG3ADDR_SUBLENGTH_Msk   (0xFFFUL << RISC_REG3ADDR_SUBLENGTH_Pos)   /*!< 0x0FFF0000 */
#define RISC_REG3ADDR_SUBLENGTH       RISC_REG3ADDR_SUBLENGTH_Msk

/*******************  Bits definition for RIMC_CR register ********************/
#define RIMC_CR_GLOCK_Pos             (0U)
#define RIMC_CR_GLOCK_Msk             (0x1UL << RIMC_CR_GLOCK_Pos)               /*!< 0x00000001 */
#define RIMC_CR_GLOCK                 RIMC_CR_GLOCK_Msk

#define RIMC_CR_WUCDONE_Pos           (1U)
#define RIMC_CR_WUCDONE_Msk           (0x1UL << RIMC_CR_WUCDONE_Pos)             /*!< 0x00000002 */
#define RIMC_CR_WUCDONE               RIMC_CR_WUCDONE_Msk

#define RIMC_CR_TDCID_Pos             (4U)
#define RIMC_CR_TDCID_Msk             (0x7UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000070 */
#define RIMC_CR_TDCID                 RIMC_CR_TDCID_Msk
#define RIMC_CR_TDCID0                (0x0UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000000 */
#define RIMC_CR_TDCID1                (0x1UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000010 */
#define RIMC_CR_TDCID2                (0x2UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000020 */
#define RIMC_CR_TDCID3                (0x3UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000030 */
#define RIMC_CR_TDCID4                (0x4UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000040 */
#define RIMC_CR_TDCID5                (0x5UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000050 */
#define RIMC_CR_TDCID6                (0x6UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000060 */
#define RIMC_CR_TDCID7                (0x7UL << RIMC_CR_TDCID_Pos)               /*!< 0x00000070 */

#define RIMC_CR_DAPCID_Pos            (8U)
#define RIMC_CR_DAPCID_Msk            (0x7UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000700 */
#define RIMC_CR_DAPCID                RIMC_CR_DAPCID_Msk
#define RIMC_CR_DAPCID0               (0x0UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000000 */
#define RIMC_CR_DAPCID1               (0x1UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000100 */
#define RIMC_CR_DAPCID2               (0x2UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000200 */
#define RIMC_CR_DAPCID3               (0x3UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000300 */
#define RIMC_CR_DAPCID4               (0x4UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000400 */
#define RIMC_CR_DAPCID5               (0x5UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000500 */
#define RIMC_CR_DAPCID6               (0x6UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000600 */
#define RIMC_CR_DAPCID7               (0x7UL << RIMC_CR_DAPCID_Pos)              /*!< 0x00000700 */

#define RIMC_CR_DDEN_Pos              (15U)
#define RIMC_CR_DDEN_Msk              (0x1UL << RIMC_CR_DDEN_Pos)                /*!< 0x00008000 */
#define RIMC_CR_DDEN                  RIMC_CR_DDEN_Msk

/*******************  Bits definition for RIMC_SR register ********************/
#define RIMC_SR_GDPEN_Pos             (0U)
#define RIMC_SR_GDPEN_Msk             (0x1UL << RIMC_SR_GDPEN_Pos)               /*!< 0x00000001 */
#define RIMC_SR_GDPEN                 RIMC_SR_GDPEN_Msk

