STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_ca35.h
/******************  Bit definition for SERC_ISR3 register  *******************/
#define SERC_ISR3_PDRS96_Pos         (0U)
#define SERC_ISR3_PDRS96_Msk         (0x1UL << SERC_ISR3_PDRS96_Pos)    /*!< 0x00000001 */
#define SERC_ISR3_PDRS96             SERC_ISR3_PDRS96_Msk
#define SERC_ISR3_PDRS97_Pos         (1U)
#define SERC_ISR3_PDRS97_Msk         (0x1UL << SERC_ISR3_PDRS97_Pos)    /*!< 0x00000002 */
#define SERC_ISR3_PDRS97             SERC_ISR3_PDRS97_Msk
#define SERC_ISR3_PDRS98_Pos         (2U)
#define SERC_ISR3_PDRS98_Msk         (0x1UL << SERC_ISR3_PDRS98_Pos)    /*!< 0x00000004 */
#define SERC_ISR3_PDRS98             SERC_ISR3_PDRS98_Msk
#define SERC_ISR3_PDRS99_Pos         (3U)
#define SERC_ISR3_PDRS99_Msk         (0x1UL << SERC_ISR3_PDRS99_Pos)    /*!< 0x00000008 */
#define SERC_ISR3_PDRS99             SERC_ISR3_PDRS99_Msk
#define SERC_ISR3_PDRS100_Pos        (4U)
#define SERC_ISR3_PDRS100_Msk        (0x1UL << SERC_ISR3_PDRS100_Pos)   /*!< 0x00000010 */
#define SERC_ISR3_PDRS100            SERC_ISR3_PDRS100_Msk
#define SERC_ISR3_PDRS101_Pos        (5U)
#define SERC_ISR3_PDRS101_Msk        (0x1UL << SERC_ISR3_PDRS101_Pos)   /*!< 0x00000020 */
#define SERC_ISR3_PDRS101            SERC_ISR3_PDRS101_Msk
#define SERC_ISR3_PDRS102_Pos        (6U)
#define SERC_ISR3_PDRS102_Msk        (0x1UL << SERC_ISR3_PDRS102_Pos)   /*!< 0x00000040 */
#define SERC_ISR3_PDRS102            SERC_ISR3_PDRS102_Msk
#define SERC_ISR3_PDRS103_Pos        (7U)
#define SERC_ISR3_PDRS103_Msk        (0x1UL << SERC_ISR3_PDRS103_Pos)   /*!< 0x00000080 */
#define SERC_ISR3_PDRS103            SERC_ISR3_PDRS103_Msk
#define SERC_ISR3_PDRS104_Pos        (8U)
#define SERC_ISR3_PDRS104_Msk        (0x1UL << SERC_ISR3_PDRS104_Pos)   /*!< 0x00000100 */
#define SERC_ISR3_PDRS104            SERC_ISR3_PDRS104_Msk
#define SERC_ISR3_PDRS105_Pos        (9U)
#define SERC_ISR3_PDRS105_Msk        (0x1UL << SERC_ISR3_PDRS105_Pos)   /*!< 0x00000200 */
#define SERC_ISR3_PDRS105            SERC_ISR3_PDRS105_Msk
#define SERC_ISR3_PDRS106_Pos        (10U)
#define SERC_ISR3_PDRS106_Msk        (0x1UL << SERC_ISR3_PDRS106_Pos)   /*!< 0x00000400 */
#define SERC_ISR3_PDRS106            SERC_ISR3_PDRS106_Msk
#define SERC_ISR3_PDRS107_Pos        (11U)
#define SERC_ISR3_PDRS107_Msk        (0x1UL << SERC_ISR3_PDRS107_Pos)   /*!< 0x00000800 */
#define SERC_ISR3_PDRS107            SERC_ISR3_PDRS107_Msk
#define SERC_ISR3_PDRS108_Pos        (12U)
#define SERC_ISR3_PDRS108_Msk        (0x1UL << SERC_ISR3_PDRS108_Pos)   /*!< 0x00001000 */
#define SERC_ISR3_PDRS108            SERC_ISR3_PDRS108_Msk
#define SERC_ISR3_PDRS109_Pos        (13U)
#define SERC_ISR3_PDRS109_Msk        (0x1UL << SERC_ISR3_PDRS109_Pos)   /*!< 0x00002000 */
#define SERC_ISR3_PDRS109            SERC_ISR3_PDRS109_Msk
#define SERC_ISR3_PDRS110_Pos        (14U)
#define SERC_ISR3_PDRS110_Msk        (0x1UL << SERC_ISR3_PDRS110_Pos)   /*!< 0x00004000 */
#define SERC_ISR3_PDRS110            SERC_ISR3_PDRS110_Msk
#define SERC_ISR3_PDRS111_Pos        (15U)
#define SERC_ISR3_PDRS111_Msk        (0x1UL << SERC_ISR3_PDRS111_Pos)   /*!< 0x00008000 */
#define SERC_ISR3_PDRS111            SERC_ISR3_PDRS111_Msk
#define SERC_ISR3_PDRS112_Pos        (16U)
#define SERC_ISR3_PDRS112_Msk        (0x1UL << SERC_ISR3_PDRS112_Pos)   /*!< 0x00010000 */
#define SERC_ISR3_PDRS112            SERC_ISR3_PDRS112_Msk
#define SERC_ISR3_PDRS113_Pos        (17U)
#define SERC_ISR3_PDRS113_Msk        (0x1UL << SERC_ISR3_PDRS113_Pos)   /*!< 0x00020000 */
#define SERC_ISR3_PDRS113            SERC_ISR3_PDRS113_Msk
#define SERC_ISR3_PDRS114_Pos        (18U)
#define SERC_ISR3_PDRS114_Msk        (0x1UL << SERC_ISR3_PDRS114_Pos)   /*!< 0x00040000 */
#define SERC_ISR3_PDRS114            SERC_ISR3_PDRS114_Msk
#define SERC_ISR3_PDRS115_Pos        (19U)
#define SERC_ISR3_PDRS115_Msk        (0x1UL << SERC_ISR3_PDRS115_Pos)   /*!< 0x00080000 */
#define SERC_ISR3_PDRS115            SERC_ISR3_PDRS115_Msk
#define SERC_ISR3_PDRS116_Pos        (20U)
#define SERC_ISR3_PDRS116_Msk        (0x1UL << SERC_ISR3_PDRS116_Pos)   /*!< 0x00100000 */
#define SERC_ISR3_PDRS116            SERC_ISR3_PDRS116_Msk
#define SERC_ISR3_PDRS117_Pos        (21U)
#define SERC_ISR3_PDRS117_Msk        (0x1UL << SERC_ISR3_PDRS117_Pos)   /*!< 0x00200000 */
#define SERC_ISR3_PDRS117            SERC_ISR3_PDRS117_Msk
#define SERC_ISR3_PDRS118_Pos        (22U)
#define SERC_ISR3_PDRS118_Msk        (0x1UL << SERC_ISR3_PDRS118_Pos)   /*!< 0x00400000 */
#define SERC_ISR3_PDRS118            SERC_ISR3_PDRS118_Msk
#define SERC_ISR3_PDRS119_Pos        (23U)
#define SERC_ISR3_PDRS119_Msk        (0x1UL << SERC_ISR3_PDRS119_Pos)   /*!< 0x00800000 */
#define SERC_ISR3_PDRS119            SERC_ISR3_PDRS119_Msk
#define SERC_ISR3_PDRS120_Pos        (24U)
#define SERC_ISR3_PDRS120_Msk        (0x1UL << SERC_ISR3_PDRS120_Pos)   /*!< 0x01000000 */
#define SERC_ISR3_PDRS120            SERC_ISR3_PDRS120_Msk
#define SERC_ISR3_PDRS121_Pos        (25U)
#define SERC_ISR3_PDRS121_Msk        (0x1UL << SERC_ISR3_PDRS121_Pos)   /*!< 0x02000000 */
#define SERC_ISR3_PDRS121            SERC_ISR3_PDRS121_Msk
#define SERC_ISR3_PDRS122_Pos        (26U)
#define SERC_ISR3_PDRS122_Msk        (0x1UL << SERC_ISR3_PDRS122_Pos)   /*!< 0x04000000 */
#define SERC_ISR3_PDRS122            SERC_ISR3_PDRS122_Msk
#define SERC_ISR3_PDRS123_Pos        (27U)
#define SERC_ISR3_PDRS123_Msk        (0x1UL << SERC_ISR3_PDRS123_Pos)   /*!< 0x08000000 */
#define SERC_ISR3_PDRS123            SERC_ISR3_PDRS123_Msk
#define SERC_ISR3_PDRS124_Pos        (28U)
#define SERC_ISR3_PDRS124_Msk        (0x1UL << SERC_ISR3_PDRS124_Pos)   /*!< 0x10000000 */
#define SERC_ISR3_PDRS124            SERC_ISR3_PDRS124_Msk
#define SERC_ISR3_PDRS125_Pos        (29U)
#define SERC_ISR3_PDRS125_Msk        (0x1UL << SERC_ISR3_PDRS125_Pos)   /*!< 0x20000000 */
#define SERC_ISR3_PDRS125            SERC_ISR3_PDRS125_Msk
#define SERC_ISR3_PDRS126_Pos        (30U)
#define SERC_ISR3_PDRS126_Msk        (0x1UL << SERC_ISR3_PDRS126_Pos)   /*!< 0x40000000 */
#define SERC_ISR3_PDRS126            SERC_ISR3_PDRS126_Msk
#define SERC_ISR3_PDRS127_Pos        (31U)
#define SERC_ISR3_PDRS127_Msk        (0x1UL << SERC_ISR3_PDRS127_Pos)   /*!< 0x80000000 */
#define SERC_ISR3_PDRS127            SERC_ISR3_PDRS127_Msk

/******************  Bit definition for SERC_ISR4 register  *******************/
#define SERC_ISR4_PDRS128_Pos        (0U)
#define SERC_ISR4_PDRS128_Msk        (0x1UL << SERC_ISR4_PDRS128_Pos)   /*!< 0x00000001 */
#define SERC_ISR4_PDRS128            SERC_ISR4_PDRS128_Msk
#define SERC_ISR4_PDRS129_Pos        (1U)
#define SERC_ISR4_PDRS129_Msk        (0x1UL << SERC_ISR4_PDRS129_Pos)   /*!< 0x00000002 */
#define SERC_ISR4_PDRS129            SERC_ISR4_PDRS129_Msk
#define SERC_ISR4_PDRS130_Pos        (2U)
#define SERC_ISR4_PDRS130_Msk        (0x1UL << SERC_ISR4_PDRS130_Pos)   /*!< 0x00000004 */
#define SERC_ISR4_PDRS130            SERC_ISR4_PDRS130_Msk
#define SERC_ISR4_PDRS131_Pos        (3U)
#define SERC_ISR4_PDRS131_Msk        (0x1UL << SERC_ISR4_PDRS131_Pos)   /*!< 0x00000008 */
#define SERC_ISR4_PDRS131            SERC_ISR4_PDRS131_Msk
#define SERC_ISR4_PDRS132_Pos        (4U)
#define SERC_ISR4_PDRS132_Msk        (0x1UL << SERC_ISR4_PDRS132_Pos)   /*!< 0x00000010 */
#define SERC_ISR4_PDRS132            SERC_ISR4_PDRS132_Msk
#define SERC_ISR4_PDRS133_Pos        (5U)
#define SERC_ISR4_PDRS133_Msk        (0x1UL << SERC_ISR4_PDRS133_Pos)   /*!< 0x00000020 */
#define SERC_ISR4_PDRS133            SERC_ISR4_PDRS133_Msk
#define SERC_ISR4_PDRS134_Pos        (6U)
#define SERC_ISR4_PDRS134_Msk        (0x1UL << SERC_ISR4_PDRS134_Pos)   /*!< 0x00000040 */
#define SERC_ISR4_PDRS134            SERC_ISR4_PDRS134_Msk
#define SERC_ISR4_PDRS135_Pos        (7U)
#define SERC_ISR4_PDRS135_Msk        (0x1UL << SERC_ISR4_PDRS135_Pos)   /*!< 0x00000080 */
#define SERC_ISR4_PDRS135            SERC_ISR4_PDRS135_Msk
#define SERC_ISR4_PDRS136_Pos        (8U)
#define SERC_ISR4_PDRS136_Msk        (0x1UL << SERC_ISR4_PDRS136_Pos)   /*!< 0x00000100 */
#define SERC_ISR4_PDRS136            SERC_ISR4_PDRS136_Msk
#define SERC_ISR4_PDRS137_Pos        (9U)
#define SERC_ISR4_PDRS137_Msk        (0x1UL << SERC_ISR4_PDRS137_Pos)   /*!< 0x00000200 */
#define SERC_ISR4_PDRS137            SERC_ISR4_PDRS137_Msk
#define SERC_ISR4_PDRS138_Pos        (10U)
#define SERC_ISR4_PDRS138_Msk        (0x1UL << SERC_ISR4_PDRS138_Pos)   /*!< 0x00000400 */
#define SERC_ISR4_PDRS138            SERC_ISR4_PDRS138_Msk
#define SERC_ISR4_PDRS139_Pos        (11U)
#define SERC_ISR4_PDRS139_Msk        (0x1UL << SERC_ISR4_PDRS139_Pos)   /*!< 0x00000800 */
#define SERC_ISR4_PDRS139            SERC_ISR4_PDRS139_Msk
#define SERC_ISR4_PDRS140_Pos        (12U)
#define SERC_ISR4_PDRS140_Msk        (0x1UL << SERC_ISR4_PDRS140_Pos)   /*!< 0x00001000 */
#define SERC_ISR4_PDRS140            SERC_ISR4_PDRS140_Msk
#define SERC_ISR4_PDRS141_Pos        (13U)
#define SERC_ISR4_PDRS141_Msk        (0x1UL << SERC_ISR4_PDRS141_Pos)   /*!< 0x00002000 */
#define SERC_ISR4_PDRS141            SERC_ISR4_PDRS141_Msk
#define SERC_ISR4_PDRS142_Pos        (14U)
#define SERC_ISR4_PDRS142_Msk        (0x1UL << SERC_ISR4_PDRS142_Pos)   /*!< 0x00004000 */
#define SERC_ISR4_PDRS142            SERC_ISR4_PDRS142_Msk
#define SERC_ISR4_PDRS143_Pos        (15U)
#define SERC_ISR4_PDRS143_Msk        (0x1UL << SERC_ISR4_PDRS143_Pos)   /*!< 0x00008000 */
#define SERC_ISR4_PDRS143            SERC_ISR4_PDRS143_Msk
#define SERC_ISR4_PDRS144_Pos        (16U)
#define SERC_ISR4_PDRS144_Msk        (0x1UL << SERC_ISR4_PDRS144_Pos)   /*!< 0x00010000 */
#define SERC_ISR4_PDRS144            SERC_ISR4_PDRS144_Msk
#define SERC_ISR4_PDRS145_Pos        (17U)
#define SERC_ISR4_PDRS145_Msk        (0x1UL << SERC_ISR4_PDRS145_Pos)   /*!< 0x00020000 */
#define SERC_ISR4_PDRS145            SERC_ISR4_PDRS145_Msk
#define SERC_ISR4_PDRS146_Pos        (18U)
#define SERC_ISR4_PDRS146_Msk        (0x1UL << SERC_ISR4_PDRS146_Pos)   /*!< 0x00040000 */
#define SERC_ISR4_PDRS146            SERC_ISR4_PDRS146_Msk
#define SERC_ISR4_PDRS147_Pos        (19U)
#define SERC_ISR4_PDRS147_Msk        (0x1UL << SERC_ISR4_PDRS147_Pos)   /*!< 0x00080000 */
#define SERC_ISR4_PDRS147            SERC_ISR4_PDRS147_Msk
#define SERC_ISR4_PDRS148_Pos        (20U)
#define SERC_ISR4_PDRS148_Msk        (0x1UL << SERC_ISR4_PDRS148_Pos)   /*!< 0x00100000 */
#define SERC_ISR4_PDRS148            SERC_ISR4_PDRS148_Msk
#define SERC_ISR4_PDRS149_Pos        (21U)
#define SERC_ISR4_PDRS149_Msk        (0x1UL << SERC_ISR4_PDRS149_Pos)   /*!< 0x00200000 */
#define SERC_ISR4_PDRS149            SERC_ISR4_PDRS149_Msk
#define SERC_ISR4_PDRS150_Pos        (22U)
#define SERC_ISR4_PDRS150_Msk        (0x1UL << SERC_ISR4_PDRS150_Pos)   /*!< 0x00400000 */
#define SERC_ISR4_PDRS150            SERC_ISR4_PDRS150_Msk
#define SERC_ISR4_PDRS151_Pos        (23U)
#define SERC_ISR4_PDRS151_Msk        (0x1UL << SERC_ISR4_PDRS151_Pos)   /*!< 0x00800000 */
#define SERC_ISR4_PDRS151            SERC_ISR4_PDRS151_Msk
#define SERC_ISR4_PDRS152_Pos        (24U)
#define SERC_ISR4_PDRS152_Msk        (0x1UL << SERC_ISR4_PDRS152_Pos)   /*!< 0x01000000 */
#define SERC_ISR4_PDRS152            SERC_ISR4_PDRS152_Msk
#define SERC_ISR4_PDRS153_Pos        (25U)
#define SERC_ISR4_PDRS153_Msk        (0x1UL << SERC_ISR4_PDRS153_Pos)   /*!< 0x02000000 */
#define SERC_ISR4_PDRS153            SERC_ISR4_PDRS153_Msk
#define SERC_ISR4_PDRS154_Pos        (26U)
#define SERC_ISR4_PDRS154_Msk        (0x1UL << SERC_ISR4_PDRS154_Pos)   /*!< 0x04000000 */
#define SERC_ISR4_PDRS154            SERC_ISR4_PDRS154_Msk
#define SERC_ISR4_PDRS155_Pos        (27U)
#define SERC_ISR4_PDRS155_Msk        (0x1UL << SERC_ISR4_PDRS155_Pos)   /*!< 0x08000000 */
#define SERC_ISR4_PDRS155            SERC_ISR4_PDRS155_Msk
#define SERC_ISR4_PDRS156_Pos        (28U)
#define SERC_ISR4_PDRS156_Msk        (0x1UL << SERC_ISR4_PDRS156_Pos)   /*!< 0x10000000 */
#define SERC_ISR4_PDRS156            SERC_ISR4_PDRS156_Msk
#define SERC_ISR4_PDRS157_Pos        (29U)
#define SERC_ISR4_PDRS157_Msk        (0x1UL << SERC_ISR4_PDRS157_Pos)   /*!< 0x20000000 */
#define SERC_ISR4_PDRS157            SERC_ISR4_PDRS157_Msk
#define SERC_ISR4_PDRS158_Pos        (30U)
#define SERC_ISR4_PDRS158_Msk        (0x1UL << SERC_ISR4_PDRS158_Pos)   /*!< 0x40000000 */
#define SERC_ISR4_PDRS158            SERC_ISR4_PDRS158_Msk
#define SERC_ISR4_PDRS159_Pos        (31U)
#define SERC_ISR4_PDRS159_Msk        (0x1UL << SERC_ISR4_PDRS159_Pos)   /*!< 0x80000000 */
#define SERC_ISR4_PDRS159            SERC_ISR4_PDRS159_Msk

/******************  Bit definition for SERC_ISR5 register  *******************/
#define SERC_ISR5_PDRS160_Pos        (0U)
#define SERC_ISR5_PDRS160_Msk        (0x1UL << SERC_ISR5_PDRS160_Pos)   /*!< 0x00000001 */
#define SERC_ISR5_PDRS160            SERC_ISR5_PDRS160_Msk
#define SERC_ISR5_PDRS161_Pos        (1U)
#define SERC_ISR5_PDRS161_Msk        (0x1UL << SERC_ISR5_PDRS161_Pos)   /*!< 0x00000002 */
#define SERC_ISR5_PDRS161            SERC_ISR5_PDRS161_Msk
#define SERC_ISR5_PDRS162_Pos        (2U)
#define SERC_ISR5_PDRS162_Msk        (0x1UL << SERC_ISR5_PDRS162_Pos)   /*!< 0x00000004 */
#define SERC_ISR5_PDRS162            SERC_ISR5_PDRS162_Msk
#define SERC_ISR5_PDRS163_Pos        (3U)
#define SERC_ISR5_PDRS163_Msk        (0x1UL << SERC_ISR5_PDRS163_Pos)   /*!< 0x00000008 */
#define SERC_ISR5_PDRS163            SERC_ISR5_PDRS163_Msk
#define SERC_ISR5_PDRS164_Pos        (4U)
#define SERC_ISR5_PDRS164_Msk        (0x1UL << SERC_ISR5_PDRS164_Pos)   /*!< 0x00000010 */
#define SERC_ISR5_PDRS164            SERC_ISR5_PDRS164_Msk
#define SERC_ISR5_PDRS165_Pos        (5U)
#define SERC_ISR5_PDRS165_Msk        (0x1UL << SERC_ISR5_PDRS165_Pos)   /*!< 0x00000020 */
#define SERC_ISR5_PDRS165            SERC_ISR5_PDRS165_Msk
#define SERC_ISR5_PDRS166_Pos        (6U)
#define SERC_ISR5_PDRS166_Msk        (0x1UL << SERC_ISR5_PDRS166_Pos)   /*!< 0x00000040 */
#define SERC_ISR5_PDRS166            SERC_ISR5_PDRS166_Msk
#define SERC_ISR5_PDRS167_Pos        (7U)
#define SERC_ISR5_PDRS167_Msk        (0x1UL << SERC_ISR5_PDRS167_Pos)   /*!< 0x00000080 */
#define SERC_ISR5_PDRS167            SERC_ISR5_PDRS167_Msk
#define SERC_ISR5_PDRS168_Pos        (8U)
#define SERC_ISR5_PDRS168_Msk        (0x1UL << SERC_ISR5_PDRS168_Pos)   /*!< 0x00000100 */
#define SERC_ISR5_PDRS168            SERC_ISR5_PDRS168_Msk
#define SERC_ISR5_PDRS169_Pos        (9U)
#define SERC_ISR5_PDRS169_Msk        (0x1UL << SERC_ISR5_PDRS169_Pos)   /*!< 0x00000200 */
#define SERC_ISR5_PDRS169            SERC_ISR5_PDRS169_Msk
#define SERC_ISR5_PDRS170_Pos        (10U)
#define SERC_ISR5_PDRS170_Msk        (0x1UL << SERC_ISR5_PDRS170_Pos)   /*!< 0x00000400 */
#define SERC_ISR5_PDRS170            SERC_ISR5_PDRS170_Msk
#define SERC_ISR5_PDRS171_Pos        (11U)
#define SERC_ISR5_PDRS171_Msk        (0x1UL << SERC_ISR5_PDRS171_Pos)   /*!< 0x00000800 */
#define SERC_ISR5_PDRS171            SERC_ISR5_PDRS171_Msk
#define SERC_ISR5_PDRS172_Pos        (12U)
#define SERC_ISR5_PDRS172_Msk        (0x1UL << SERC_ISR5_PDRS172_Pos)   /*!< 0x00001000 */
#define SERC_ISR5_PDRS172            SERC_ISR5_PDRS172_Msk
#define SERC_ISR5_PDRS173_Pos        (13U)
#define SERC_ISR5_PDRS173_Msk        (0x1UL << SERC_ISR5_PDRS173_Pos)   /*!< 0x00002000 */
#define SERC_ISR5_PDRS173            SERC_ISR5_PDRS173_Msk
#define SERC_ISR5_PDRS174_Pos        (14U)
#define SERC_ISR5_PDRS174_Msk        (0x1UL << SERC_ISR5_PDRS174_Pos)   /*!< 0x00004000 */
#define SERC_ISR5_PDRS174            SERC_ISR5_PDRS174_Msk
#define SERC_ISR5_PDRS175_Pos        (15U)
#define SERC_ISR5_PDRS175_Msk        (0x1UL << SERC_ISR5_PDRS175_Pos)   /*!< 0x00008000 */
#define SERC_ISR5_PDRS175            SERC_ISR5_PDRS175_Msk
#define SERC_ISR5_PDRS176_Pos        (16U)
#define SERC_ISR5_PDRS176_Msk        (0x1UL << SERC_ISR5_PDRS176_Pos)   /*!< 0x00010000 */
#define SERC_ISR5_PDRS176            SERC_ISR5_PDRS176_Msk
#define SERC_ISR5_PDRS177_Pos        (17U)
#define SERC_ISR5_PDRS177_Msk        (0x1UL << SERC_ISR5_PDRS177_Pos)   /*!< 0x00020000 */
#define SERC_ISR5_PDRS177            SERC_ISR5_PDRS177_Msk
#define SERC_ISR5_PDRS178_Pos        (18U)
#define SERC_ISR5_PDRS178_Msk        (0x1UL << SERC_ISR5_PDRS178_Pos)   /*!< 0x00040000 */
#define SERC_ISR5_PDRS178            SERC_ISR5_PDRS178_Msk
#define SERC_ISR5_PDRS179_Pos        (19U)
#define SERC_ISR5_PDRS179_Msk        (0x1UL << SERC_ISR5_PDRS179_Pos)   /*!< 0x00080000 */
#define SERC_ISR5_PDRS179            SERC_ISR5_PDRS179_Msk
#define SERC_ISR5_PDRS180_Pos        (20U)
#define SERC_ISR5_PDRS180_Msk        (0x1UL << SERC_ISR5_PDRS180_Pos)   /*!< 0x00100000 */
#define SERC_ISR5_PDRS180            SERC_ISR5_PDRS180_Msk
#define SERC_ISR5_PDRS181_Pos        (21U)
#define SERC_ISR5_PDRS181_Msk        (0x1UL << SERC_ISR5_PDRS181_Pos)   /*!< 0x00200000 */
#define SERC_ISR5_PDRS181            SERC_ISR5_PDRS181_Msk
#define SERC_ISR5_PDRS182_Pos        (22U)
#define SERC_ISR5_PDRS182_Msk        (0x1UL << SERC_ISR5_PDRS182_Pos)   /*!< 0x00400000 */
#define SERC_ISR5_PDRS182            SERC_ISR5_PDRS182_Msk
#define SERC_ISR5_PDRS183_Pos        (23U)
#define SERC_ISR5_PDRS183_Msk        (0x1UL << SERC_ISR5_PDRS183_Pos)   /*!< 0x00800000 */
#define SERC_ISR5_PDRS183            SERC_ISR5_PDRS183_Msk
#define SERC_ISR5_PDRS184_Pos        (24U)
#define SERC_ISR5_PDRS184_Msk        (0x1UL << SERC_ISR5_PDRS184_Pos)   /*!< 0x01000000 */
#define SERC_ISR5_PDRS184            SERC_ISR5_PDRS184_Msk
#define SERC_ISR5_PDRS185_Pos        (25U)
#define SERC_ISR5_PDRS185_Msk        (0x1UL << SERC_ISR5_PDRS185_Pos)   /*!< 0x02000000 */
#define SERC_ISR5_PDRS185            SERC_ISR5_PDRS185_Msk
#define SERC_ISR5_PDRS186_Pos        (26U)
#define SERC_ISR5_PDRS186_Msk        (0x1UL << SERC_ISR5_PDRS186_Pos)   /*!< 0x04000000 */
#define SERC_ISR5_PDRS186            SERC_ISR5_PDRS186_Msk
#define SERC_ISR5_PDRS187_Pos        (27U)
#define SERC_ISR5_PDRS187_Msk        (0x1UL << SERC_ISR5_PDRS187_Pos)   /*!< 0x08000000 */
#define SERC_ISR5_PDRS187            SERC_ISR5_PDRS187_Msk
#define SERC_ISR5_PDRS188_Pos        (28U)
#define SERC_ISR5_PDRS188_Msk        (0x1UL << SERC_ISR5_PDRS188_Pos)   /*!< 0x10000000 */
#define SERC_ISR5_PDRS188            SERC_ISR5_PDRS188_Msk
#define SERC_ISR5_PDRS189_Pos        (29U)
#define SERC_ISR5_PDRS189_Msk        (0x1UL << SERC_ISR5_PDRS189_Pos)   /*!< 0x20000000 */
#define SERC_ISR5_PDRS189            SERC_ISR5_PDRS189_Msk
#define SERC_ISR5_PDRS190_Pos        (30U)
#define SERC_ISR5_PDRS190_Msk        (0x1UL << SERC_ISR5_PDRS190_Pos)   /*!< 0x40000000 */
#define SERC_ISR5_PDRS190            SERC_ISR5_PDRS190_Msk
#define SERC_ISR5_PDRS191_Pos        (31U)
#define SERC_ISR5_PDRS191_Msk        (0x1UL << SERC_ISR5_PDRS191_Pos)   /*!< 0x80000000 */
#define SERC_ISR5_PDRS191            SERC_ISR5_PDRS191_Msk

