STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_ca35.h
/* Bit fields for USB3_GSBUSCFG0 register */
#define USB3_GSBUSCFG0_INCRBRSTENA_Pos                           0
#define USB3_GSBUSCFG0_INCRBRSTENA_Msk                           (0x1UL << 0)
#define USB3_GSBUSCFG0_INCRBRSTENA                               (0x1UL << 0)
#define USB3_GSBUSCFG0_INCR4BRSTENA_Pos                          1
#define USB3_GSBUSCFG0_INCR4BRSTENA_Msk                          (0x1UL << 1)
#define USB3_GSBUSCFG0_INCR4BRSTENA                              (0x1UL << 1)
#define USB3_GSBUSCFG0_INCR8BRSTENA_Pos                          2
#define USB3_GSBUSCFG0_INCR8BRSTENA_Msk                          (0x1UL << 2)
#define USB3_GSBUSCFG0_INCR8BRSTENA                              (0x1UL << 2)
#define USB3_GSBUSCFG0_INCR16BRSTENA_Pos                         3
#define USB3_GSBUSCFG0_INCR16BRSTENA_Msk                         (0x1UL << 3)
#define USB3_GSBUSCFG0_INCR16BRSTENA                             (0x1UL << 3)
#define USB3_GSBUSCFG0_INCR32BRSTENA_Pos                         4
#define USB3_GSBUSCFG0_INCR32BRSTENA_Msk                         (0x1UL << 4)
#define USB3_GSBUSCFG0_INCR32BRSTENA                             (0x1UL << 4)
#define USB3_GSBUSCFG0_INCR64BRSTENA_Pos                         5
#define USB3_GSBUSCFG0_INCR64BRSTENA_Msk                         (0x1UL << 5)
#define USB3_GSBUSCFG0_INCR64BRSTENA                             (0x1UL << 5)
#define USB3_GSBUSCFG0_INCR128BRSTENA_Pos                        6
#define USB3_GSBUSCFG0_INCR128BRSTENA_Msk                        (0x1UL << 6)
#define USB3_GSBUSCFG0_INCR128BRSTENA                            (0x1UL << 6)
#define USB3_GSBUSCFG0_INCR256BRSTENA_Pos                        7
#define USB3_GSBUSCFG0_INCR256BRSTENA_Msk                        (0x1UL << 7)
#define USB3_GSBUSCFG0_INCR256BRSTENA                            (0x1UL << 7)
#define USB3_GSBUSCFG0_DESBIGEND_Pos                             10
#define USB3_GSBUSCFG0_DESBIGEND_Msk                             (0x1UL << 10)
#define USB3_GSBUSCFG0_DESBIGEND                                 (0x1UL << 10)
#define USB3_GSBUSCFG0_DATBIGEND_Pos                             11
#define USB3_GSBUSCFG0_DATBIGEND_Msk                             (0x1UL << 11)
#define USB3_GSBUSCFG0_DATBIGEND                                 (0x1UL << 11)
#define USB3_GSBUSCFG0_DESWRREQINFO_Pos                          16
#define USB3_GSBUSCFG0_DESWRREQINFO_Msk                          (0xfUL << 16)
#define USB3_GSBUSCFG0_DESWRREQINFO                              (0xfUL << 16)
#define USB3_GSBUSCFG0_DATWRREQINFO_Pos                          20
#define USB3_GSBUSCFG0_DATWRREQINFO_Msk                          (0xfUL << 20)
#define USB3_GSBUSCFG0_DATWRREQINFO                              (0xfUL << 20)
#define USB3_GSBUSCFG0_DESRDREQINFO_Pos                          24
#define USB3_GSBUSCFG0_DESRDREQINFO_Msk                          (0xfUL << 24)
#define USB3_GSBUSCFG0_DESRDREQINFO                              (0xfUL << 24)
#define USB3_GSBUSCFG0_DATRDREQINFO_Pos                          28
#define USB3_GSBUSCFG0_DATRDREQINFO_Msk                          (0xfUL << 28)
#define USB3_GSBUSCFG0_DATRDREQINFO                              (0xfUL << 28)

/* Bit fields for USB3_GSBUSCFG1 register */
#define USB3_GSBUSCFG1_PipeTransLimit_Pos                        8
#define USB3_GSBUSCFG1_PipeTransLimit_Msk                        (0xfUL << 8)
#define USB3_GSBUSCFG1_PipeTransLimit                            (0xfUL << 8)
#define USB3_GSBUSCFG1_EN1KPAGE_Pos                              12
#define USB3_GSBUSCFG1_EN1KPAGE_Msk                              (0x1UL << 12)
#define USB3_GSBUSCFG1_EN1KPAGE                                  (0x1UL << 12)

/* Bit fields for USB3_GTXTHRCFG register */
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize_Pos                     16
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize_Msk                     (0xffUL << 16)
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize                         (0xffUL << 16)
#define USB3_GTXTHRCFG_UsbTxPktCnt_Pos                           24
#define USB3_GTXTHRCFG_UsbTxPktCnt_Msk                           (0xfUL << 24)
#define USB3_GTXTHRCFG_UsbTxPktCnt                               (0xfUL << 24)
#define USB3_GTXTHRCFG_UsbTxPktCntSel_Pos                        29
#define USB3_GTXTHRCFG_UsbTxPktCntSel_Msk                        (0x1UL << 29)
#define USB3_GTXTHRCFG_UsbTxPktCntSel                            (0x1UL << 29)

/* Bit fields for USB3_GRXTHRCFG register */
#define USB3_GRXTHRCFG_ResvISOCOUTSpc_Pos                        0
#define USB3_GRXTHRCFG_ResvISOCOUTSpc_Msk                        (0x1fffUL << 0)
#define USB3_GRXTHRCFG_ResvISOCOUTSpc                            (0x1fffUL << 0)
#define USB3_GRXTHRCFG_UsbMaxRxBurstSize_Pos                     19
#define USB3_GRXTHRCFG_UsbMaxRxBurstSize_Msk                     (0x1fUL << 19)
#define USB3_GRXTHRCFG_UsbMaxRxBurstSize                         (0x1fUL << 19)
#define USB3_GRXTHRCFG_UsbRxPktCnt_Pos                           24
#define USB3_GRXTHRCFG_UsbRxPktCnt_Msk                           (0xfUL << 24)
#define USB3_GRXTHRCFG_UsbRxPktCnt                               (0xfUL << 24)
#define USB3_GRXTHRCFG_UsbRxPktCntSel_Pos                        29
#define USB3_GRXTHRCFG_UsbRxPktCntSel_Msk                        (0x1UL << 29)
#define USB3_GRXTHRCFG_UsbRxPktCntSel                            (0x1UL << 29)

/* Bit fields for USB3_GCTL register */
#define USB3_GCTL_DSBLCLKGTNG_Pos                                0
#define USB3_GCTL_DSBLCLKGTNG_Msk                                (0x1UL << 0)
#define USB3_GCTL_DSBLCLKGTNG                                    (0x1UL << 0)
#define USB3_GCTL_GblHibernationEn_Pos                           1
#define USB3_GCTL_GblHibernationEn_Msk                           (0x1UL << 1)
#define USB3_GCTL_GblHibernationEn                               (0x1UL << 1)
#define USB3_GCTL_U2EXIT_LFPS_Pos                                2
#define USB3_GCTL_U2EXIT_LFPS_Msk                                (0x1UL << 2)
#define USB3_GCTL_U2EXIT_LFPS                                    (0x1UL << 2)
#define USB3_GCTL_DISSCRAMBLE_Pos                                3
#define USB3_GCTL_DISSCRAMBLE_Msk                                (0x1UL << 3)
#define USB3_GCTL_DISSCRAMBLE                                    (0x1UL << 3)
#define USB3_GCTL_SCALEDOWN_Pos                                  4
#define USB3_GCTL_SCALEDOWN_Msk                                  (0x3UL << 4)
#define USB3_GCTL_SCALEDOWN                                      (0x3UL << 4)
#define USB3_GCTL_RAMCLKSEL_Pos                                  6
#define USB3_GCTL_RAMCLKSEL_Msk                                  (0x3UL << 6)
#define USB3_GCTL_RAMCLKSEL                                      (0x3UL << 6)
#define USB3_GCTL_DEBUGATTACH_Pos                                8
#define USB3_GCTL_DEBUGATTACH_Msk                                (0x1UL << 8)
#define USB3_GCTL_DEBUGATTACH                                    (0x1UL << 8)
#define USB3_GCTL_U1U2TimerScale_Pos                             9
#define USB3_GCTL_U1U2TimerScale_Msk                             (0x1UL << 9)
#define USB3_GCTL_U1U2TimerScale                                 (0x1UL << 9)
#define USB3_GCTL_SOFITPSYNC_Pos                                 10
#define USB3_GCTL_SOFITPSYNC_Msk                                 (0x1UL << 10)
#define USB3_GCTL_SOFITPSYNC                                     (0x1UL << 10)
#define USB3_GCTL_CORESOFTRESET_Pos                              11
#define USB3_GCTL_CORESOFTRESET_Msk                              (0x1UL << 11)
#define USB3_GCTL_CORESOFTRESET                                  (0x1UL << 11)
#define USB3_GCTL_PRTCAPDIR_Pos                                  12
#define USB3_GCTL_PRTCAPDIR_Msk                                  (0x3UL << 12)
#define USB3_GCTL_PRTCAPDIR                                      (0x3UL << 12)
#define USB3_GCTL_FRMSCLDWN_Pos                                  14
#define USB3_GCTL_FRMSCLDWN_Msk                                  (0x3UL << 14)
#define USB3_GCTL_FRMSCLDWN                                      (0x3UL << 14)
#define USB3_GCTL_U2RSTECN_Pos                                   16
#define USB3_GCTL_U2RSTECN_Msk                                   (0x1UL << 16)
#define USB3_GCTL_U2RSTECN                                       (0x1UL << 16)
#define USB3_GCTL_BYPSSETADDR_Pos                                17
#define USB3_GCTL_BYPSSETADDR_Msk                                (0x1UL << 17)
#define USB3_GCTL_BYPSSETADDR                                    (0x1UL << 17)
#define USB3_GCTL_MASTERFILTBYPASS_Pos                           18
#define USB3_GCTL_MASTERFILTBYPASS_Msk                           (0x1UL << 18)
#define USB3_GCTL_MASTERFILTBYPASS                               (0x1UL << 18)
#define USB3_GCTL_PWRDNSCALE_Pos                                 19
#define USB3_GCTL_PWRDNSCALE_Msk                                 (0x1fffUL << 19)
#define USB3_GCTL_PWRDNSCALE                                     (0x1fffUL << 19)

/* Bit fields for USB3_GPMSTS register */
#define USB3_GPMSTS_U2Wakeup_Pos                                 0
#define USB3_GPMSTS_U2Wakeup_Msk                                 (0x3ffUL << 0)
#define USB3_GPMSTS_U2Wakeup                                     (0x3ffUL << 0)
#define USB3_GPMSTS_U3Wakeup_Pos                                 12
#define USB3_GPMSTS_U3Wakeup_Msk                                 (0x1fUL << 12)
#define USB3_GPMSTS_U3Wakeup                                     (0x1fUL << 12)
#define USB3_GPMSTS_PortSel_Pos                                  28
#define USB3_GPMSTS_PortSel_Msk                                  (0xfUL << 28)
#define USB3_GPMSTS_PortSel                                      (0xfUL << 28)

